export class DraftConfig{
    teamersThumbnailsURL: string[] = [
        "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d1/Antu_flag-red.svg/768px-Antu_flag-red.svg.png",
        "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Antu_flag-blue.svg/768px-Antu_flag-blue.svg.png",
        "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/Antu_flag-green.svg/768px-Antu_flag-green.svg.png",
        "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2b/Antu_flag-yellow.svg/768px-Antu_flag-yellow.svg.png",
        "https://media.discordapp.net/attachments/698295115063492758/837417222732644372/768px-Antu_flag-purple.svg.png?width=599&height=599",
        "https://cdn.discordapp.com/attachments/698295115063492758/838985443642310666/768px-Antu_flag-grey.svg.png",
    ];

    civilizations = new Map([
        ["<:australia:701066628523098183>", "Австралия <:Australia:701066628523098183> Джон Кэртин"],
        ["<:america:701066550412836894>",   "Америка <:America:701066550412836894> Теодор Рузвельт (Прогрессивист)"],
        ["<:england:701066628489674772>",   "Англия <:England:701066628489674772> Виктория"],
        ["a<:england:701066628489674772>",  "Англия <:England:701066628489674772> Алиенора Аквитанская"],
        ["<:arabia:701066550442065970>",    "Аравия <:Arabia:701066550442065970> Саладин"],
        ["<:aztecs:701066550169436302>",    "Ацтеки <:Aztecs:701066550169436302> Монтесума"],
        ["<:brazil:701066699537121281>",    "Бразилия <:Brazil:701066699537121281> Педру II"],
        ["<:hungary:701066628674224128>",   "Венгрия <:Hungary:701066628674224128> Матьяш I"],
        ["<:germany:701066628653252658>",   "Германия <:Germany:701066628653252658> Фридрих Барбаросса"],
        ["<:greece:701900974108835900>",    "Греция <:Greece:701900974108835900> Горго"],
        ["p<:greece:701900974108835900>",   "Греция <:Greece:701900974108835900>  Перикл"],
        ["<:georgia:701066628518903848>",   "Грузия <:Georgia:701066628518903848> Тамара"],
        ["<:egypt:701066550265774162>",     "Египет <:Egypt:701066550265774162> Клеопатра"],
        ["<:zulu:701066699553767465>",      "Зулусы <:Zulu:701066699553767465> Чака"],
        ["<:india:701066628640800838>",     "Индия <:IndiaG:701066628640800838> Ганди"],
        ["c<:india:701066628640800838>",    "Индия <:IndiaG:701066628640800838> Чандрагупта"],
        ["<:indonesia:701066550425288754>", "Индонезия <:Indonesia:701066550425288754> Трибхувана"],
        ["<:inca:701066628737007666>",      "Инки <:Inca:701066628737007666> Пачакутек"],
        ["<:spain:701066699704893460>",     "Испания <:Spain:701066699704893460> Филипп II"],
        ["<:canada:701066699557961829>",    "Канада <:Canada:701066699557961829> Уилфрид Лорье"],
        ["<:china:701066550433677382>",     "Китай <:China:701066550433677382> Цинь Шихуанди"],
        ["<:kongo:701066628661641293>",     "Конго <:Kongo:701066628661641293> Мвемба а Нзинга"],
        ["<:korea:701066550232219801>",     "Корея <:Korea:701066550232219801> Сондок"],
        ["<:cree:701066550504980480>",      "Кри <:Cree:701066550504980480> Паундмейкер"],
        ["<:khmer:701066628150067302>",     "Кхмеры <:Khmer:701066628150067302> Джайаварман VII"],
        ["<:macedonia:701066628540006470>", "Македония <:Macedonia:701066628540006470> Александр"],
        ["<:mali:701066699490852914>",      "Мали <:Mali:701066699490852914> Манса Муса"],
        ["<:maori:701066699801231460>",     "Маори <:Maori:701066699801231460> Купе"],
        ["<:mongolia:701066699482464276>",  "Монголия <:Mongolia:701066699482464276> Чингисхан"],
        ["<:mapuche:701066724036050974>",   "Мапуче <:Mapuche:701066724036050974> Лаутаро"],
        ["<:nederlands:701066724111548476>","Нидерланды <:Nederlands:701066724111548476> Вильгельмина"],
        ["<:norway:701066723721216011>",    "Норвегия <:Norway:701066723721216011> Харальд Суровый"],
        ["<:nubia:701066699700699136>",     "Нубия <:Nubia:701066699700699136> Аманиторе"],
        ["<:ottoman:701066699230674976>",   "Оттоманы <:Ottoman:701066699230674976> Сулейман"],
        ["<:persia:701066723713089608>",    "Персия <:Persia:701066723713089608> Кир"],
        ["<:poland:701066699486789752>",    "Польша <:Poland:701066699486789752> Ядвига"],
        ["<:rome:701066699499372615>",      "Рим <:Rome:701066699499372615> Траян"],
        ["<:russia:701066723868147734>",    "Россия <:Russia:701066723868147734> Петр Великий"],
        ["<:scythia:701066699608162334>",   "Скифия <:Scythia:701066699608162334> Томирис"],
        ["<:phoenicia:701066628141678623>", "Финикия <:Phoenicia:701066628141678623> Дидона"],
        ["<:france:701066550051864628>",    "Франция <:France:701066550051864628> Екатерина Медичи (Черная королева)"],
        ["a<:france:701066550051864628>",   "Франция <:France:701066550051864628> Алиенора Аквитанская"],
        ["<:sweden:701066699608293376>",    "Швеция <:Sweden:701066699608293376> Кристина"],
        ["<:scotland:701066724031594566>",  "Шотландия <:Scotland:701066724031594566> Роберт I Брюс"],
        ["<:sumeria:701066699516018688>",   "Шумерия <:Sumeria:701066699516018688> Гильгамеш"],
        ["<:japan:701066628498063380>",     "Япония <:Japan:701066628498063380> Ходзе Токимунэ"],
        ["<:maya:713789628829663283>",      "Майя <:Maya:713789628829663283> Госпожа Шести Небес"],
        ["<:colombia:713789628590850149>",  "Колумбия <:Colombia:713789628590850149> Симон Боливар"],
        ["<:ethiopia:736271149159284807>",  "Эфиопия <:Ethiopia:736271149159284807> Менелик II"],
        ["r<:america:701066550412836894>",  "Америка <:America:701066550412836894> Мужественный всадник Тедди"],
        ["m<:france:701066550051864628>",   "Франция <:France:701066550051864628> Великолепная Екатерина"],
        ["<:byzantium:759396923382956043>", "Византия <:Byzantium:759396923382956043> Василий II"],
        ["<:gaul:759396911206629386>",      "Галлия <:Gaul:759396911206629386> Амбиорикс"],
        ["<:babylon:779706266062815242>",   "Вавилон <:Babylon:779706266062815242> Хаммурапи"],
        ["k<:china:701066550433677382>",    "Китай <:China:701066550433677382> Хубилай"],
        ["k<:mongolia:701066699482464276>", "Монголия <:Mongolia:701066699482464276> Хубилай"],
        ["<:vietnam:804417073140334603>",   "Вьетнам <:Vietnam:804417073140334603> Госпожа Чьеу"],
        ["<:portugal:825055292629844001>",  "Португалия <:Portugal:825055292629844001> Жуан III"],
    ]);

    indexNationPairArray: number[][] = [
        [2, 39],    // Англия (Виктория), Финикия
        [31, 45],   // Норвегия, Япония
        [19, 37],   // Канада, Россия
        [23, 34],   // Кри, Персия
        [40, 28],   // Екатерина Медичи (Чёрная королева), Чингисхан
        [26, 57],   // Мали, Португалия

        [40, 41],   // Екатерина Медичи (Чёрная Королева), Алиенора Французская
        [2, 3],     // Алиенора Английская, Виктория

        [9, 10],    // Греция (2)
        [14, 15],   // Индия (2)
        [1, 49],    // Америка (2)
        [28, 55],   // Монголия (2)
        [20, 54],   // Китай (2)
    ];
    ffaCivilizationMin: number = 1;
    ffaCivilizationMax: number = 16;
    teamersCommandsMin: number = 2;
    teamersCommandsMax: number = this.teamersThumbnailsURL.length;
    blindCivilizationMin: number = 2;
    blindCivilizationMax: number = 16;
}
