export class NewConfig{
    newOptionsFFA: string[][] = [
        ["🌍 **Карта**", "🇵 Пангея", "🇭 Нагорье", "7️⃣ Семь морей", "🇱 Озёра", "🇨 Континенты", "🇦 Архипелаги", "🇮 Внутреннее море", "🇫 Фрактал", "🏝️ Континенты и острова"],
        ["🌋 **Стихийные бедствия**", "2️⃣", "3️⃣", "4️⃣"],
        ["🌽 **Бонусные ресурсы**", "🇸 Стандартные", "🌽 Изобильные"],
        ["🐎 **Стратегические ресурсы**", "🇸 Стандартные", "🐎 Изобильные", "<:Yes:808418109710794843> Гарантированные"],
        ["⭐ **Количество чудес природы**", "🌅 Стандартное", "🌠 Изобильное"],
        ["🏞️ **Возраст мира**", "🏕️  Стандартный", "🏔️ Новый"],
        ["🪙 **Торговля золотом**", "<:No:808418109319938099> Запрещена", "🇦 Между союзниками", "🇫 Между друзьями и союзниками", "🪙 Разрешена"],
        ["🐴 **Торговля стратегическими ресурсами**", "<:No:808418109319938099> Запрещена", "🇦 Между союзниками", "🇫 Между друзьями и союзниками", "🐴 Разрешена"],
        ["🤝 **Число дружб**", "2️⃣", "3️⃣", "♾️"],
        ["⚔️ **Военный союз**", "<:No:808418109319938099> Запрещен", "🗡️ Разрешен"],
        ["💬 **Общение**", "🕵️ Любое", "📰 Только публичное"],
        ["🃏 **Тип драфта**", "🎩 Классический", "🤷 Взакрытую"]
    ];

    newOptionsTeamers: string[][] = [
        ["🌍 **Карта**", "🇵 Пангея", "🇭 Нагорье", "7️⃣ Семь морей", "🇱 Озёра", "🇨 Континенты", "🇦 Архипелаги", "🇮 Внутреннее море", "🇫 Фрактал", "🏝️ Континенты и острова"],
        ["🌐 **Формат игры**", "🎩 Классический", "🏆 CWC"],
    ];

    newOptionHeadersEmojisFFA: string[][] = [
        ["🇵", "🇭", "7️⃣", "🇱", "🇨", "🇦", "🇮", "🇫", "🏝️"],
        ["2️⃣", "3️⃣", "4️⃣"],
        ["🇸", "🌽"],
        ["🇸", "🐎", "<:yes:808418109710794843>"],
        ["🌅", "🌠"],
        ["🏕️", "🏔️"],
        ["<:no:808418109319938099>", "🇦", "🇫", "🪙"],
        ["<:no:808418109319938099>", "🇦", "🇫", "🐴"],
        ["2️⃣", "3️⃣", "♾️"],
        ["<:no:808418109319938099>", "🗡️"],
        ["🕵️", "📰"],
        ["🎩", "🤷"]
    ];

    newOptionHeadersEmojisTeamers: string[][] = [
        ["🇵", "🇭", "7️⃣", "🇱", "🇨", "🇦", "🇮", "🇫", "🏝️"],
        ["🎩", "🏆"],
    ];

    newBanMessageEmoji: string = "🤔";
    newBan: string = `🤔 **Баны наций**: *добавьте эмодзи нации под этим сообщением; если проголосует большинство, то нация окажется в бане.*`
    newCaptainTeamers: string = `👑 **Выборы двух капитанов команд**`;

    votingTime = 150*1000;            //Секунд, учёт дополнительного времени при помощи количества сообщений
    newPlayersMin: number = 4;
}
