export class CommunityConfig{
    scrap: string = `**__Скрап__** (scrap) – окончание игры без определенного победителя.
            
            Голосование за скрап может проводится не чаще, чем раз в 5 ходов, либо в случае, если изменилось состояние игрока:
            • игрок покинул игру не по правилам;
            • вылет игрока;
            • замена игрока.
            
            Для успешного скрапа необходима минимальная доля голосов, которая зависит от текущего хода в игре.
            
            • 1-29 ход – 2/3 игроков.
            • 30-59 ход – 3/4 игроков.
            • 60-79 ход – все, кроме 1 игрока.
            • 80+ ход – единогласно.`;

    irrelevant: string = `__**Иррелевантность**__ (irr, ирр) – просьба игрока покинуть FFA до завершения по причине объективной невозможности победить или повлиять на игровую ситуацию.
            
            Голосование за иррелевантность может проводится не чаще, чем раз в 5 ходов в отношении одного игрока.
            Голосование за иррелевантность должен инициировать игрок, являющийся целью голосования, или хост игры из-за трехкратного вылета.
            **Никто из игроков не может наложить вето на это голосование.**
            В случае, если инициатором голосования за иррелевантность является хост, то цель голосования не учитывается при подсчете голосов.
            
            Для успешной иррелевантности необходима минимальная доля голосов, которая зависит от текущего хода в игре.
            • 1-49 ход – единогласно.
            • 50-79 ход – ¾ игроков.
            • 80+ ход – ⅔ игроков.
            • Если игрок имеет право вето: любой ход – единогласно.
            • Если игрок не занимает одно из 2 последних мест по счёту: любой ход  – единогласно.`;

    remap: string = `**__Ремап__** (remap) – голосование за смену игровой карты из-за объективно плохой стартовой локации одного из игроков.
            
            Голосование за ремап в FFA проводится до 15 хода включительно. 
            Для успешного ремапа необходимо согласие **всех игроков, кроме 2.**
            В случае поражения одного из игроков, ремап и авторемап проводить запрещается.
            
            Голосование за ремап в Teamers проводится до 8 хода включительно. Для успешного ремапа необходимо согласие хотя бы 50% команд. Команды могут выразить свое согласие на ремап лишь 1 раз за игру.
            Примечание: при ремапе в FFA, вы можете опубликовать свой скриншот стартовой локации для бóльшей вероятности успешного ремапа.
            
            **__Авторемап__** – ремап, который не требует голосования для его проведения. Не учитывается при подсчете голосов за ремап. Может произойти в FFA до 15 хода включительно.
            Авторемап гарантирован в случаях, описанных ниже.
            • Были выставлены неправильные настройки, влияющие на игровую карту.
            • Вы не можете основать 3 новых города в радиусе 5 клеток от своего изначального местоположения.
                - радиус считается по проходимым клеткам без изучения любых технологий или социальных институтов
                - без учета любых других городов (кроме столиц и городов-государств)
                - на картах **Пангея**, **Континенты,** **Нагорье**, **Внутреннее море**, **Озёра**.`

    leave: string = `Запрещено покидать игру до её окончания. Вы можете покинуть игру без наказания в одном из случаев ниже.
    
            • Вы потеряли хотя бы 2/3 своих городов.
            • Вы потеряли изначальную столицу.
            • Вас признали иррелевантным с помощью голосования (см. /rules irr).
            • Вас заменил другой игрок (см. /rules sub).
    
            Если игрок покинул игру не по правилам (например, по техническим причинам), то у него есть **10 минут** с момента выхода из игры, чтобы зайти в игру обратно. По истечении срока игрок признается покинувшим партию и получает за это соответствующее наказание.
            Перед продолжением игры игроки решают, продолжать игру или искать нового игрока вместо ливнувшего игрока (см. !sub).`;

    veto: string = `Право вето – право игрока единолично признать любое голосование в FFA проваленным, если не сказано другого.
            Права вето начинают действовать с **60 хода игры**.
    
            ⌛ **1. Вето по очкам.**
            • Игроки, занимающие лидирующие места по очкам, имеют право вето. Для 2-7 игроков – 2 игрока; для 8-9 игроков – 3; для 10-12 игроков – 4.
            ⚗️ **2. Научное вето.**
            • Каждый игрок, который завершил проект «Запуск искусственного спутника».
            • Игрок, изучивший наибольшее число технологий.
            • Игрок, имеющий наибольшее количество науки в ход.
            🎵 **3. Культурное вето.**
            • Игрок, имеющий больше всего внешних туристов.
            • Каждый игрок, у которого 500 и более туризма в ход.
            ⚔️ **4. Военное вето.**
            • Игрок с наибольшей военной мощью.
            • Игрок с наибольшим количеством захваченных столиц. *Примечение: при настройке правил игры \"Бан военной победы – да\" данный пункт военного вето действует*.
            🗿 **5. Религиозное вето.**
            • Игрок, обративший большинство существующих цивилизаций в свою религию, **но хотя бы 1/3 от их числа**.
            🕊️ **6. Дипломатическое вето.**
            • Игрок, имеющий наибольшее число очков дипломатической победы, **но хотя бы 10.**`;

    tie: string = `**Смена места** – договор нескольких игроков о том, что при подсчёте рейтинга вы будете занимать место выше, чем то, которое указано во вкладке \"Всемирный Рейтинг\".
            Для смены места необходимо согласие **всех игроков, между которыми вы сменяете свою позицию**.
    
            Примечание: СС с определённым победителем и соответствующей сменой остальных игроков __по счёту__ не является сменой места.
            
    
    
            **Ничья** – договор нескольких игроков о том, что все они занимают одно и то же место. При подсчёте рейтинга такие игроки приобретают или теряют меньше рейтинга друг от друга.
    
            • **Фактическая ничья**: к концу игры несколько цивилизаций равны по счёту или одновременно побеждают какой-либо победой во время смены хода.
            • **Договорная ничья**: игроки договариваются о том, что при подсчёте рейтинга они занимают одно и то же место.
    
            Договорная ничья возможна с теми игроками, которые занимают **соседние с вами места**.
            Для договорной ничьи вы обязаны получить согласие на это **от всех игроков, занимающих место, которое вы хотите разделить**.
            Для договорной ничьи на **первом месте** вы обязаны получить согласие от **всех оставшихся игроков**.`;

    sub: string = `Замена игрока – процедура, в результате которой один из игроков выходит из игры, и на его место приходит другой игрок, который будет продолжать игру за предыдущего. 
            Новый игрок действует в полном соответствии с правилами, как если бы он полностью играл данную игру. При подсчете рейтинга считается, что заменяющий игрок победил предыдущего.
        
            Игрок может объявить о своей замене **в любой момент игры**, если имеет игрока, который будет его заменять. В данном случае исходный игрок не получит никаких наказаний за досрочный выход из игры.
        
            Игрок может заменить игрока, который покинул партию не по правилам, **в ход выхода из игры**. В таком случае исходный игрок получит наказание в обычном порядке. Игрок, который покинул данную партию, не сможет заменить в ней какого-либо игрока, кроме его заменяющего.
        
            • Для замены в *FFA* требуется отсутствие нарушений по правилу 1.3 (просмотр стрима).
            • Для замены в *Teamers* дополнительно к этому требуется **согласие всех капитанов** команд на замену.`;

    cc: string = `CC – досрочное окончание FFA с определенным победителем.
            Голосование за СС может проводится **не чаще, чем раз в 5 ходов**. Голосование за СС должен инициировать игрок, не являющийся целью голосования.

            **Цель голосования не может наложить вето на это голосование.**

            Для успешного CC необходима минимальная доля голосов, которая зависит от текущего хода в игре.
            • 1-79 ход – единогласно.
            • 80+ ход – 2/3 игроков.`;
}